tutorials/dyMFoam/dynamicMotionSolverFvMesh/piston2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    walls
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
    ACMI1_blockage
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }
    ACMI2_blockage
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }
}


// ************************************************************************* //
