tutorials/dyMFoam/dynamicMotionSolverFvMesh/piston2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    /*00*/ (0.5   0   0)
    /*01*/ (1   0   0)
    /*02*/ (1 0.4   0)
    /*03*/ (0.5 0.4   0)
    /*04*/ (0.5   0 0.1)
    /*05*/ (1   0 0.1)
    /*06*/ (1 0.4 0.1)
    /*07*/ (0.5 0.4 0.1)

    /*08*/ (1   0   0)
    /*09*/ (3   0   0)
    /*10*/ (3   5   0)
    /*11*/ (1   5   0)
    /*12*/ (1   0 0.1)
    /*13*/ (3   0 0.1)
    /*14*/ (3   5 0.1)
    /*15*/ (1   5 0.1)
);

blocks
(
   hex (0 1  2  3  4  5  6  7) (20 20 1) simpleGrading (1 1 1)
   hex (8 9 10 11 12 13 14 15) (30 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 14 13 9)
        );
    }
    movingWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (11 15 14 10)
            (9 13 12 8)
        );
    }
    couple1
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    couple2
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
